# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

Load the three dataset

In [2]:
import pandas as pd
data_1 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

In [11]:
data_2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")

In [5]:
data_3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [14]:
# Column consistency for data_3
data_3.columns = ['Customer','ST','GENDER','Education','Customer Lifetime Value','Income','Monthly Premium Auto','Number of Open Complaints','Total Claim Amount','Policy Type','Vehicle Class']

In [15]:
# Let's combine the dataframes
all_data = pd.concat([data_1, data_2, data_3], axis=0)
all_data.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46

In [18]:
# Correction for whole data column consistency
all_data.columns = ['customer','state','gender','education','customer_lifetime_value','income','monthly_premium_auto','number_of_open_complaints','policy_type','vehicle_class','total_claim_amount']
all_data.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46

In [19]:
# Drop the null values
all_data.dropna(inplace = True)

In [21]:
# Check the data
all_data.isnull().sum() # No null value

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [31]:
# Correct gender column
gender_mapping = {'Male':'M', 'Femal':'F', 'female':'F', 'F':'F', 'M': 'M'}
all_data['gender_mapped'] = all_data['gender'].map(gender_mapping)
all_data.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46,F
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472,F

In [32]:
# Correct state abbriviations
state_mapping = {'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington', 'Oregon':'Oregon','California':'California','Washington':'Washington','Nevada':'Nevada'}
all_data['state_mapped'] = all_data['state'].map(state_mapping)
all_data.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46,F,NaN
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472,F,Nevada

In [33]:
# Correct Bachelors
educ_mapping = {'Bachelor':'Bachelor','College':'College','High School or Below':'High School or Below','Master':'Master','Doctor':'Doctor','Bachelors':'Bachelor'}
all_data['education_mapped'] = all_data['education'].map(educ_mapping)
all_data.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46,F,NaN,Bachelor
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472,F,Nevada,Bachelor

In [36]:
# Remove % from customer life time value
all_data['customer_lifetime_value'] = all_data['customer_lifetime_value'].str.replace('%', '')
all_data.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.46,F,NaN,Bachelor
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472,F,Nevada,Bachelor

In [37]:
# Correct vehicle class
all_data['vehicle_class'] = all_data['vehicle_class'].str.replace('Sports Car', 'Luxury')
all_data['vehicle_class'] = all_data['vehicle_class'].str.replace('Luxury SUV', 'Luxury')
all_data['vehicle_class'] = all_data['vehicle_class'].str.replace('Luxury Car', 'Luxury')
all_data['vehicle_class'].value_counts()

Four-Door Car    4564
Two-Door Car     1874
SUV              1754
Luxury            818
Name: vehicle_class, dtype: int64

In [42]:
# Check the different values of "number_of_open_complaints" variable
all_data['number_of_open_complaints'].unique()

array(['1/0/00', '1/1/00', '1/2/00', '1/4/00', '1/3/00', '1/5/00', 0, 2,
       3, 1, 5, 4], dtype=object)

In [44]:
# Use split() to extract the middle value in "number of open complaints
split_num_comp = all_data['number_of_open_complaints'].str.split(pat = '/', expand = True)
all_data['num_of_open_complaints'] = split_num_comp[1]

In [46]:
# Check the value of the new column 'num_of_open_complaints'
all_data['num_of_open_complaints'].unique()

array(['0', '1', '2', '4', '3', '5', nan], dtype=object)

In [49]:
# Drop unneccessary columns 
all_data_ = all_data.drop(['number_of_open_complaints'], axis = 1)
all_data_.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped,num_of_open_complaints
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.46,F,NaN,Bachelor,0
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,Personal Auto,Two-Door Car,566.472,F,Nevada,Bachelor,0

In [51]:
# Check for null value
all_data.isnull().sum()

customer                        0
state                           0
gender                          0
education                       0
customer_lifetime_value         0
income                          0
monthly_premium_auto            0
number_of_open_complaints       0
policy_type                     0
vehicle_class                   0
total_claim_amount              0
gender_mapped                7070
state_mapped                 1618
education_mapped                0
num_of_open_complaints       7070
dtype: int64

In [52]:
# Let's drop the null values
all_data.dropna(inplace = True)

In [55]:
# let's check the data now for null value
all_data.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
gender_mapped                0
state_mapped                 0
education_mapped             0
num_of_open_complaints       0
dtype: int64

In [58]:
# Let's drop 'number_of_open_complaints' column 
all_data_ = all_data.drop(['number_of_open_complaints'], axis = 1)
# Check the data
all_data_.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped,num_of_open_complaints
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,Personal Auto,Two-Door Car,566.472,F,Nevada,Bachelor,0
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,Corporate Auto,SUV,529.881,M,California,Bachelor,0

In [59]:
# let's check the shape of the data
all_data.shape

(1624, 15)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [3]:
# Get data
mark_data = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv')
mark_data.head(2)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [14]:
# Check the columns of the dataset
mark_data.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

In [11]:
# Check the frequency of the sales channels
mark_data['sales_channel'].value_counts()

Agent          4121
Branch         3022
Call Center    2141
Web            1626
Name: sales_channel, dtype: int64

In [28]:
pivot_mark_data = mark_data.pivot_table(index='sales_channel', values= ['customer_lifetime_value'], aggfunc='sum')
pivot_mark_data

               customer_lifetime_value
sales_channel
Agent                     3.305789e+07
Branch                    2.435920e+07
Call Center               1.736429e+07
Web                       1.269763e+07

In [29]:
# Round the total revenue to two decimal points
for value in pivot_mark_data.customer_lifetime_value:
    values = round(value,2)
    print(values)

33057887.85
24359201.21
17364288.37
12697632.9

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [33]:
pivot_mark_data_ = mark_data.pivot_table(index = 'gender', columns = 'education', values = ['customer_lifetime_value'], aggfunc = 'mean')
pivot_mark_data_

          customer_lifetime_value                            \
education                Bachelor      College       Doctor
gender
F                     7874.269478  7748.823325  7328.508916
M                     7703.601675  8052.459288  7415.333638


education High School or Below       Master
gender
F                  8675.220201  8157.053154
M                  8149.687783  8168.832659

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here